/*
 * SPDX-License-Identifier: BSD-3-Clause
 *
 * SPDX-FileCopyrightText: Copyright TF-RMM Contributors.
 */

#ifndef SMC_RMI_H
#define SMC_RMI_H

#include <smc.h>

/*
 * This file describes the Realm Management Interface (RMI) Application Binary
 * Interface (ABI) for SMC calls made from Non-secure state to the RMM and
 * serviced by the RMM.
 */

#define MAKE_RMI_REVISION(_major, _minor)	(((_major) << UL(16)) | (_minor))
#define RMI_ABI_VERSION_GET_MAJOR(_version)	((_version) >> UL(16))
#define RMI_ABI_VERSION_GET_MINOR(_version)	((_version) & UL(0xFFFF))

#define SMC64_RMI_FID(_offset)		SMC64_STD_FID(RMI, _offset)

#define IS_SMC64_RMI_FID(_fid)		IS_SMC64_STD_FAST_IN_RANGE(RMI, _fid)

/* Command completed successfully. index is zero. */
#define RMI_SUCCESS			U(0)

/*
 * The value of a command input value caused the command to fail.
 * Index is zero.
 */
#define RMI_ERROR_INPUT			U(1)

/*
 * An attribute of a Realm does not match the expected value.
 * index varies between usages.
 */
#define RMI_ERROR_REALM			U(2)

/*
 * An attribute of a REC does not match the expected value.
 * Index is zero.
 */
#define RMI_ERROR_REC			U(3)

/*
 * On the primary RTT tree, an RTT walk terminated before reaching
 * the target RTT level, or reached an RTTE with an unexpected value.
 * index: RTT level at which the walk terminated
 *
 * If returned as output value for RMI_RTT_SET_S2AP then:
 * X1: `progress_addr` (IPA): The IPA where the RTT walk failed

#define SMC_RMI_VDEV_GET_STATE			SMC64_RMI_FID(U(0x39))

/*
 * FID: 0xC400018A
 *
 * arg0 == PA of the RD
 * arg1 == PA of the PDEV
 * arg2 == PA of the VDEV
 */
#define SMC_RMI_VDEV_UNLOCK			SMC64_RMI_FID(U(0x3A))

/*
 * FID: 0xC400018B
 *
 * arg0 == RD address
 * arg1 == REC address
 * arg2 == Start address
 * arg3 == End address
 *
 * ret1 == Top of the address range where the S2AP was updated,
 *	   if ret0 == RMI_SUCCESS
 */
#define SMC_RMI_RTT_SET_S2AP			SMC64_RMI_FID(U(0x3B))

/*
 * FID: 0xC400018C
 */
#define SMC_RMI_MEC_SET_SHARED			SMC64_RMI_FID(U(0x3C))

/*
 * FID: 0xC400018D
 */
#define SMC_RMI_MEC_SET_PRIVATE			SMC64_RMI_FID(U(0x3D))

/*
 * FID: 0xC400018E
 */
#define SMC_RMI_VDEV_COMPLETE			SMC64_RMI_FID(U(0x3E))

/*
 * FID: 0xC400018F is not used.
 */

/*
 * Revised 64-bit Arm CCA function ID range reservation is
 * 0xC400_0150 - 0xC400_02CF
 *
 * Within this range RMI FIDs allocation is split in two ranges:
 *
 * 0xC4000150 - 0xC400018F - RMI FID range1
 * 0xC4000190 - 0xC40001BF - RSI FID range
 * 0xC40001D0 - 0xC40001D3 - RMI FID range2
 */

/*
 * FID: 0xC40001D0
 *
 * arg0 == PA of the RD
 * arg1 == PA of the PDEV
 * arg2 == PA of the VDEV
 */
#define SMC_RMI_VDEV_GET_INTERFACE_REPORT	SMC64_RMI_FID(U(0x80))

/*
 * FID: 0xC40001D1
 *
 * arg0 == PA of the RD
 * arg1 == PA of the PDEV
 * arg2 == PA of the VDEV
 * arg3 == PA of VDEV parameters
 */
#define SMC_RMI_VDEV_GET_MEASUREMENTS		SMC64_RMI_FID(U(0x81))

/*
 * FID: 0xC40001D2
 *
 * arg0 == PA of the RD
 * arg1 == PA of the PDEV
 * arg2 == PA of the VDEV
 */
#define SMC_RMI_VDEV_LOCK			SMC64_RMI_FID(U(0x82))

/*
 * FID: 0xC40001D3
 *
 * arg0 == PA of the RD
 * arg1 == PA of the PDEV
 * arg2 == PA of the VDEV
 */
#define SMC_RMI_VDEV_START			SMC64_RMI_FID(U(0x83))

/* Size of Realm Personalization Value */
#ifndef CBMC
#define RPV_SIZE		64
#else
/*
 * Small RPV size so that `struct rd` fits in the reduced sized granule defined
 * for CBMC
 */
#define RPV_SIZE		1
#endif

/* RmiRealmFlags0 format */
#define RMI_REALM_FLAGS0_LPA2_SHIFT	UL(0)
#define RMI_REALM_FLAGS0_LPA2_WIDTH	UL(1)

#define RMI_REALM_FLAGS0_SVE_SHIFT	UL(1)
#define RMI_REALM_FLAGS0_SVE_WIDTH	UL(1)

#define RMI_REALM_FLAGS0_PMU_SHIFT	UL(2)
#define RMI_REALM_FLAGS0_PMU_WIDTH	UL(1)

#define RMI_REALM_FLAGS0_DA_SHIFT	UL(3)
#define RMI_REALM_FLAGS0_DA_WIDTH	UL(1)

/* RmiRealmFlags1 format */
#define RMI_REALM_FLAGS1_RTT_TREE_PP_SHIFT	UL(0)
#define RMI_REALM_FLAGS1_RTT_TREE_PP_WIDTH	UL(1)

#define RMI_REALM_FLAGS1_S2AP_ENC_SHIFT		UL(1)
#define RMI_REALM_FLAGS1_S2AP_ENC_WIDTH		UL(1)

/* Possible values for RmiRttS2APEncoding flag */
#define RMI_S2AP_DIRECT				UL(0)
#define RMI_S2AP_INDIRECT			UL(1)

#ifndef __ASSEMBLER__
/*
 * Defines member of structure and reserves space
 * for the next member with specified offset.
 */
#define SET_MEMBER_RMI	SET_MEMBER

/*
 * The Realm attribute parameters are shared by the Host via
 * RMI_REALM_CREATE::params_ptr. The values can be observed or modified
 * either by the Host or by the Realm.
 */
struct rmi_realm_params {
	/* Flags */
	SET_MEMBER_RMI(unsigned long flags0, 0, 0x8);			/* Offset 0 */
	/* Requested IPA width */
	SET_MEMBER_RMI(unsigned int s2sz, 0x8, 0x10);			/* 0x8 */
	/* Requested SVE vector length */
	SET_MEMBER_RMI(unsigned int sve_vl, 0x10, 0x18);		/* 0x10 */
	/* Requested number of breakpoints */
	SET_MEMBER_RMI(unsigned int num_bps, 0x18, 0x20);		/* 0x18 */
	/* Requested number of watchpoints */
	SET_MEMBER_RMI(unsigned int num_wps, 0x20, 0x28);		/* 0x20 */
	/* Requested number of PMU counters */
	SET_MEMBER_RMI(unsigned int pmu_num_ctrs, 0x28, 0x30);		/* 0x28 */
	/* Measurement algorithm */
	SET_MEMBER_RMI(unsigned char algorithm, 0x30, 0x38);		/* 0x30 */
	/* Number of auxiliary Planes */
	SET_MEMBER_RMI(unsigned int num_aux_planes, 0x38, 0x400);
	/* Realm Personalization Value */
	SET_MEMBER_RMI(unsigned char rpv[RPV_SIZE], 0x400, 0x440);	/* 0x400 */
	/*
	 * If ATS is enabled, determines the stage 2 translation used by devices
	 * assigned to the Realm.
	 */
	SET_MEMBER_RMI(unsigned long ats_plane, 0x440, 0x800);		/* 0x440 */

	SET_MEMBER_RMI(struct {
			/* Virtual Machine Identifier */
			unsigned short vmid;				/* 0x800 */
			/* Realm Translation Table base */
			unsigned long rtt_base;				/* 0x808 */
			/* RTT starting level */
			long rtt_level_start;				/* 0x810 */
			/* Number of starting level RTTs */
			unsigned int rtt_num_start;			/* 0x818 */
		   }, 0x800, 0x820);
	/* RmiRealmFlags1 */
	SET_MEMBER_RMI(unsigned long flags1, 0x820, 0x828);		/* 0x820 */
	/* MECID */
	SET_MEMBER_RMI(long mecid, 0x828, 0xF00);			/* 0x828 */
	/* Auxiliary Virtual Machine Identifiers */
	SET_MEMBER_RMI(unsigned short aux_vmid[3], 0xF00, 0xF80);	/* 0xF00 */
	/* Base address of auxiliary RTTs */
	SET_MEMBER_RMI(unsigned long aux_rtt_base[3], 0xF80, 0x1000);	/* 0xF80 */
};

/*
 * The REC attribute parameters are shared by the Host via
 * RMI_REC_CREATE::params_ptr. The values can be observed or modified
 * either by the Host or by the Realm which owns the REC.
 */
struct rmi_rec_params {
	/* Flags */
	SET_MEMBER_RMI(unsigned long flags, 0, 0x100);	/* Offset 0 */
	/* MPIDR of the REC */
	SET_MEMBER_RMI(unsigned long mpidr, 0x100, 0x200);	/* 0x100 */
	/* Program counter */
	SET_MEMBER_RMI(unsigned long pc, 0x200, 0x300);	/* 0x200 */
	/* General-purpose registers */
	SET_MEMBER_RMI(unsigned long gprs[REC_CREATE_NR_GPRS], 0x300, 0x800); /* 0x300 */
	SET_MEMBER_RMI(struct {
			/* Number of auxiliary Granules */
			unsigned long num_aux;			/* 0x800 */
			/* Addresses of auxiliary Granules */
			unsigned long aux[MAX_REC_AUX_GRANULES];/* 0x808 */
		   }, 0x800, 0x1000);
};

/*
 * Structure contains data passed from the Host to the RMM on REC entry
 */
struct rmi_rec_enter {
	/* Flags */
	SET_MEMBER_RMI(unsigned long flags, 0, 0x200);	/* Offset 0 */
	/* General-purpose registers */
	SET_MEMBER_RMI(unsigned long gprs[REC_EXIT_NR_GPRS], 0x200, 0x300); /* 0x200 */
	SET_MEMBER_RMI(struct {
			/* GICv3 Hypervisor Control Register */
			unsigned long gicv3_hcr;			/* 0x300 */
			/* GICv3 List Registers */
			unsigned long gicv3_lrs[REC_GIC_NUM_LRS];	/* 0x308 */
		   }, 0x300, 0x800);
};

/*
 * RmiRecExitFlags
 * Fieldset contains flags provided by the RMM during REC exit.
 * Width: 64 bits
 */
#define RMI_REC_EXIT_FLAGS_RIPAS_DEV_SHARED_SHIFT	U(0)
#define RMI_REC_EXIT_FLAGS_RIPAS_DEV_SHARED_WIDTH	U(1)

/*
 * Structure contains data passed from the RMM to the Host on REC exit
 */
struct rmi_rec_exit {
	/* Exit reason */
	SET_MEMBER_RMI(unsigned long exit_reason, 0, 0x100);/* Offset 0 */
	SET_MEMBER_RMI(struct {
			/* Exception Syndrome Register */
			unsigned long esr;		/* 0x100 */
			/* Fault Address Register */
			unsigned long far;		/* 0x108 */
			/* Hypervisor IPA Fault Address register */
			unsigned long hpfar;		/* 0x110 */
			/* Index of RTT tree active at time of exit */
			unsigned long rtt_tree;		/* 0x118 */
			/* Level of requested RTT */
			long rtt_level;			/* 0x120 */
		   }, 0x100, 0x200);
	/* General-purpose registers */
	SET_MEMBER_RMI(unsigned long gprs[REC_EXIT_NR_GPRS], 0x200, 0x300); /* 0x200 */
	SET_MEMBER_RMI(struct {
			/* GICv3 Hypervisor Control Register */
			unsigned long gicv3_hcr;	/* 0x300 */
			/* GICv3 List Registers */
			unsigned long gicv3_lrs[REC_GIC_NUM_LRS]; /* 0x308 */
			/* GICv3 Maintenance Interrupt State Register */
			unsigned long gicv3_misr;	/* 0x388 */
			/* GICv3 Virtual Machine Control Register */
			unsigned long gicv3_vmcr;	/* 0x390 */
		   }, 0x300, 0x400);
	SET_MEMBER_RMI(struct {
			/* Counter-timer Physical Timer Control Register */
			unsigned long cntp_ctl;		/* 0x400 */
			/* Counter-timer Physical Timer CompareValue Register */
			unsigned long cntp_cval;	/* 0x408 */
			/* Counter-timer Virtual Timer Control Register */
			unsigned long cntv_ctl;		/* 0x410 */
			/* Counter-timer Virtual Timer CompareValue Register */
			unsigned long cntv_cval;	/* 0x418 */
		   }, 0x400, 0x500);
	SET_MEMBER_RMI(struct {
			/* Base address of pending RIPAS change */
			unsigned long ripas_base;	/* 0x500 */
			/* Size of pending RIPAS change */
			unsigned long ripas_top;	/* 0x508 */
			/* RIPAS value of pending RIPAS change */
			unsigned char ripas_value;	/* 0x510 */
		   }, 0x500, 0x520);
	SET_MEMBER_RMI(struct {
			/* Base addr of target region for pending S2AP change */
			unsigned long s2ap_base; /* 0x520 */
			/* Top addr of target region for pending S2AP change */
			unsigned long s2ap_top; /* 0x528 */
			/* Virtual device ID 1 */
			unsigned long vdev_id_1; /* 0x530 */
			/* Virtual device ID 2 */
			unsigned long vdev_id_2; /* 0x538 */
			/* Base IPA of target region for VDEV mapping validation */
			unsigned long dev_mem_base; /* 0x540 */
			/* Top IPA of target region for VDEV mapping validation */
			unsigned long dev_mem_top; /* 0x548 */
			/* Base PA of device memory region */
			unsigned long dev_mem_pa; /* 0x550 */
		   }, 0x520, 0x600);

	/* Host call immediate value */
	SET_MEMBER_RMI(unsigned int imm, 0x600, 0x608);
	/* UInt64: Plane Index */
	SET_MEMBER_RMI(unsigned long plane, 0x608, 0x700);
	/* PMU overflow status */
	SET_MEMBER_RMI(unsigned long pmu_ovf_status, 0x700, 0x800);
};

/*
 * Structure contains shared information between RMM and Host
 * during REC entry and REC exit.
 */
struct rmi_rec_run {
	/* Entry information */
	SET_MEMBER_RMI(struct rmi_rec_enter enter, 0, 0x800);	/* Offset 0 */
	/* Exit information */
	SET_MEMBER_RMI(struct rmi_rec_exit exit, 0x800, 0x1000);/* 0x800 */
};

/*
 * RmiPdevSpdm
 * Represents whether communication with the device uses SPDM.
 * Width: 1 bit
 */
#define RMI_PDEV_SPDM_FALSE			U(0)
#define RMI_PDEV_SPDM_TRUE			U(1)

/*
 * RmiPdevIde
 * Represents whether the link to the device is protected using IDE.
 * Width: 1 bit
 */
#define RMI_PDEV_IDE_FALSE			U(0)
#define RMI_PDEV_IDE_TRUE			U(1)

/*
